Examinator/src/Enums/АдресатыСообщенийСУО/АдресатыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АдресатыСообщенийСУО</name>
  <enumValues>
    <name>НаФоруме</name>
  </enumValues>
  <enumValues>
    <name>УчастникамМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникамПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>УчастникуМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникуПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>Преподавателям</name>
  </enumValues>
  <enumValues>
    <name>Преподавателю</name>
  </enumValues>
  <enumValues>
    <name>УчебнойГруппе</name>
  </enumValues>
  <enumValues>
    <name>Пользователю</name>
  </enumValues>
  <enumValues>
    <name>Администратору</name>
  </enumValues>
  <enumValues>
    <name>Организатору</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/ДоступныеАдресатыСообщенийСУО/ДоступныеАдресатыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступныеАдресатыСообщенийСУО</name>
  <dimensions>
    <name>АдресатОбсуждения</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/АдресатыСообщенийСУО/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СформироватьДанныеВыбора") Тогда
		Возврат;
	КонецЕсли;
		
	СтандартнаяОбработка = Ложь; // Всегда
	
	// Определяем список выбора с учетом настроек
	
	Если Параметры.Свойство("УчитыватьНастройки") Тогда
		
		НовыеДанныеВыбора = Новый СписокЗначений;

		Если Параметры.Свойство("УчитыватьНастройки") Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДоступныеАдресатыСообщенийСУО.АдресатОбсуждения КАК АдресатОбсуждения
				|ИЗ
				|	РегистрСведений.ДоступныеАдресатыСообщенийСУО КАК ДоступныеАдресатыСообщенийСУО";

			Результат = Запрос.Выполнить();

			Если НЕ Результат.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();

				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Элемент = НовыеДанныеВыбора.Добавить();
					Элемент.Значение = ВыборкаДетальныеЗаписи.АдресатОбсуждения;
					Элемент.Представление = ВыборкаДетальныеЗаписи.АдресатОбсуждения;
				КонецЦикла;
				
			КонецЕсли;
				
		КонецЕсли;
			
		Если НовыеДанныеВыбора.Количество() > 0 Тогда 
			
			ДанныеВыбора = НовыеДанныеВыбора; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Определяем список выбора
	
	Если ДанныеВыбора = Неопределено Тогда

		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	АдресатыСообщенийСУО.Ссылка
			|ИЗ
			|	Перечисление.АдресатыСообщенийСУО КАК АдресатыСообщенийСУО
			|
			|УПОРЯДОЧИТЬ ПО
			|	АдресатыСообщенийСУО.Порядок";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение      = ВыборкаДетальныеЗаписи.Ссылка;
			Элемент.Представление = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	// Удаляем недоступные значения
	
	Если Параметры.Свойство("ДоступныеЗначения") Тогда
		
		Сч = ДанныеВыбора.Количество();
		
		Пока Сч > 0 Цикл
			
			ЭлементВыбора = ДанныеВыбора.Получить(Сч - 1);

			Если Параметры.ДоступныеЗначения.Найти(ЭлементВыбора.Значение) = Неопределено Тогда
				ДанныеВыбора.Удалить(ЭлементВыбора);	
			КонецЕсли;
			
			Сч = Сч - 1;
			
		КонецЦикла;	
			
	КонецЕсли;

	// Удаляем значение "На форуме" (всегда)
	
	Если ДанныеВыбора <> Неопределено Тогда
		
		ЭлементВыбора = ДанныеВыбора.НайтиПоЗначению(Перечисления.АдресатыСообщенийСУО.НаФоруме);
		
		Если ЭлементВыбора <> Неопределено Тогда
			ДанныеВыбора.Удалить(ЭлементВыбора);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеИзСтроки(Знач ЗначениеСтрока) Экспорт
	
	Если ЗначениеСтрока = "toUser" Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.Пользователю;
	КонецЕсли;
	
	Если ЗначениеСтрока = "toForum" Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.НаФоруме;
	КонецЕсли;
	
	Возврат Перечисления.АдресатыСообщенийСУО[ЗначениеСтрока];
	
КонецФункции
